Tekla Open API Reference for Tekla Structures 2025
Parallel.LineToLine Method (Line, Line, Double)
 Returns true if the given lines are parallel within the given angular tolerance.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool LineToLine(
	Line Line1,
	Line Line2,
	double Tolerance
)
Public Shared Function LineToLine (
	Line1 As Line,
	Line2 As Line,
	Tolerance As Double
) As Boolean
Parameters
Line1
Type: Tekla.Structures.Geometry3d.Line
The first line to be used.
Line2
Type: Tekla.Structures.Geometry3d.Line
The second line to be used.
Tolerance
Type: System.Double
The angular tolerance (in radians) to be used.
Return Value
Type: Boolean
True if the given lines are parallel within the given tolerance.
See Also
Reference
Parallel Class
LineToLine Overload
Tekla.Structures.Geometry3d Namespace